{
  "weather_query": {
    "name": "Weather Inquiry",
    "description": "Weather information query service",
    "example": "JSON：[{'name': 'date', 'desc': 'Specific date for weather inquiry. Date format: yyyy-MM-dd', 'value': ''}]\nInput: I want the weather for May 1, 2023\nAnswer: {'name': 'date', 'value': '2023-05-01'}",
    "parameters": [
      {
        "name": "date",
        "desc": "Specific date for weather inquiry. Date format: yyyy-MM-dd",
        "type": "string",
        "required": true
      },
      {
        "name": "location",
        "desc": "City or location for weather inquiry",
        "type": "string",
        "required": true
      }
    ]
  },
  
  "hotel_booking": {
    "name": "Hotel Booking",
    "description": "Hotel booking service",
    "parameters": [
      {
        "name": "Check-in Location",
        "desc": "Specific location of the hotel, can be a city, region, etc.",
        "type": "string",
        "required": true
      },
      {
        "name": "Check-in Start Date",
        "desc": "Start date for hotel check-in, date format: yyyy-MM-dd",
        "type": "string",
        "required": true
      },
      {
        "name": "Check-in End Date",
        "desc": "End date for hotel check-in, date format: yyyy-MM-dd",
        "type": "string",
        "required": true
      },
      {
        "name": "Hotel Grade",
        "desc": "Grade of the hotel, such as luxury, economy, etc.",
        "type": "string",
        "required": true
      }
    ]
  },

  "conference_query": {
    "name": "Client Meeting Booking",
    "description": "Client meeting booking, users describe booking-related information to help book meetings, such as needing a ten-person meeting room at 8 AM on Sunday. Slots should be filled by the user, not by requesting an external API.",
    "parameters": [
      {
        "name": "Specific Time for Meeting Booking",
        "desc": "Specific time for meeting booking. change user's answer to the time in the format yyyy/MM/dd HH:mm.",
        "type": "string",
        "required": true
      },
      {
        "name": "Meeting Duration",
        "desc": "Duration of the meeting. Please let user choose from 'half an hour', '1 hour', or '2 hours'.",
        "type": "string",
        "required": true
      },
      {
        "name": "Meeting Theme",
        "desc": "Topics to be discussed in the meeting, format: choose one from 'Finance', 'Project', 'Requirement'. Note that you must assume this is an enumerated type of data, you can only choose one of these three themes, not derive possible themes from user input. If the user does not provide any information related to the meeting content or explicitly state the meeting theme, leave this as an empty string.",
        "type": "string",
        "required": true
      },
      {
        "name": "Meeting Name",
        "desc": "Name of the meeting, note that the meeting name is not the meeting theme, do not confuse them, e.g., Third Quarter Financial Report Meeting, SenseTime AI Development Project Meeting, etc. If the user does not explicitly state what the meeting name is, you can analyze and infer a suitable name from the user's meeting purpose, etc. If the user does not provide any information related to the meeting content, leave this as an empty string.",
        "type": "string",
        "required": true
      },
      {
        "name": "Meeting Booker",
        "desc": "The Booker of the meeting, a full name of the booker e.g., Jie Li, Xiaoming Wang, etc.",
        "type": "string",
        "required": true
      },
      {
        "name": "Number of participants",
        "desc": "The number of people attending the meeting is mainly to make the most efficient use of the meeting room space. Do not ask user to answer in a specific form, but yourself should change user's answer format to a string of Arabic numerals.",
        "type": "string",
        "required": true
      }
    ]
  },
  "order_query": {
    "name": "Meeting Meal Booking",
    "description": "After booking a meeting room, book lunch or dinner for the meeting room. Users describe booking-related information to help book lunch or dinner, such as needing to book lunch on Sunday. Slots should be filled by the user, not by requesting an external API.",
    "parameters": [
      {
        "name": "Specific Time for Booking",
        "desc": "Specific time for booking. Please provide the time in the format yyyy/MM/dd HH:mm.",
        "type": "string",
        "required": true
      },
      {
        "name": "Booking Lunch or Dinner",
        "desc": "Book lunch or dinner, e.g., lunch, dinner",
        "type": "string",
        "required": true
      },
      {
        "name": "Name of the Booker",
        "desc": "Name of the person booking lunch or dinner, format: plain text",
        "type": "string",
        "required": false
      },
      {
        "name": "Phone Number of the Booker",
        "desc": "Phone number of the person booking lunch or dinner, format: plain numbers",
        "type": "int",
        "required": false
      }
    ]
  }
}
